# two csv files that have common id. Find the id's that has maximum salary amount  and return top 5 salary ids in the form of a dataframe

In [4]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-11-openjdk-amd64"
os.environ["SPARK_HOME"] = r"/home/pyspark/spark-3.0.0-preview2-bin-hadoop2.7"

In [5]:
import findspark
findspark.init(r'/home/pyspark/spark-3.0.0-preview2-bin-hadoop2.7')

In [9]:
import pyspark
from pyspark.sql import SparkSession

In [10]:
spark = SparkSession \
    .builder \
    .appName("Python Spark SQL basic example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

spark.read.format("csv").option("header", "true").load("EmployeeDetails.csv")

DataFrame[Emp ID: string, Name Prefix: string, First Name: string, Middle Initial: string, Last Name: string, Gender: string]

In [12]:
df=spark.read.format("csv").option("header", "true").load("EmployeeDetails.csv")

In [13]:
df

DataFrame[Emp ID: string, Name Prefix: string, First Name: string, Middle Initial: string, Last Name: string, Gender: string]

In [14]:
df_sal = spark.read.format("csv").option("header", "true").load("EmployeeSalary.csv")

In [15]:
df_sal

DataFrame[Emp ID: string, Age in Yrs.: string, Salary: string, Place Name: string, County: string, City: string, State: string, Zip: string, Region: string]

In [16]:
df.show()

+------+-----------+----------+--------------+---------+------+
|Emp ID|Name Prefix|First Name|Middle Initial|Last Name|Gender|
+------+-----------+----------+--------------+---------+------+
|677509|       Drs.|      Lois|             H|   Walker|     F|
|940761|        Ms.|    Brenda|             S| Robinson|     F|
|428945|        Dr.|       Joe|             W| Robinson|     M|
|408351|       Drs.|     Diane|             I|    Evans|     F|
|193819|        Mr.|  Benjamin|             R|  Russell|     M|
|499687|        Mr.|   Patrick|             F|   Bailey|     M|
|539712|        Ms.|     Nancy|             T|    Baker|     F|
|380086|       Mrs.|     Carol|             V|   Murphy|     F|
|477616|       Hon.|   Frances|             B|    Young|     F|
|162402|       Hon.|     Diana|             T| Peterson|     F|
|231469|        Mr.|     Ralph|             L|   Flores|     M|
|153989|      Prof.|      Jack|             C|Alexander|     M|
|386158|       Mrs.|   Melissa|             Q|     King|     F|
|301576|       Hon.|     Wayne|             G|   Watson|     M|
|441771|       Mrs.|    Cheryl|             O|    Scott|     F|
|528509|       Hon.|     Paula|             G|     Diaz|     F|
|912990|        Mr.|    Joshua|             T|  Stewart|     M|
|214352|        Ms.|   Theresa|             G|      Lee|     F|
|890290|       Hon.|     Julia|             S|    Scott|     F|
|622406|        Mr.|    Thomas|             Q|    Lewis|     M|
+------+-----------+----------+--------------+---------+------+
only showing top 20 rows

In [17]:
df_sal.show()

+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
|Emp ID|Age in Yrs.|Salary|    Place Name|        County|          City|State|  Zip|   Region|
+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
|677509|      36.36|168251|        Denver|        Denver|        Denver|   CO|80224|     West|
|940761|      47.02| 51063|     Stonewall|       De Soto|     Stonewall|   LA|71078|    South|
|428945|      54.15| 50155|  Michigantown|       Clinton|  Michigantown|   IN|46057|  Midwest|
|408351|      39.67|180294|      Hydetown|      Crawford|      Hydetown|   PA|16328|Northeast|
|193819|      40.31|117642|       Fremont|       Waupaca|       Fremont|   WI|54940|  Midwest|
|499687|      34.86| 72305|     Macksburg|       Madison|     Macksburg|   IA|50155|  Midwest|
|539712|      22.14| 98189|       Atlanta|        Fulton|       Atlanta|   GA|30334|    South|
|380086|      59.12| 60918|   Blanchester|       Clinton|   Blanchester|   OH|45107|  Midwest|
|477616|      58.18|121587|       Delmita|         Starr|       Delmita|   TX|78536|    South|
|162402|      29.73| 43010|Eureka Springs|       Carroll|Eureka Springs|   AR|72632|    South|
|231469|       42.5|118457|       Sabetha|        Nemaha|       Sabetha|   KS|66534|  Midwest|
|153989|      22.21| 82965|     Las Vegas|         Clark|     Las Vegas|   NV|89170|     West|
|386158|      45.45|166892| New Matamoras|    Washington| New Matamoras|   OH|45767|  Midwest|
|301576|       21.1| 92758|         Maida|      Cavalier|         Maida|   ND|58255|  Midwest|
|441771|      59.47| 92220|      Quecreek|      Somerset|      Quecreek|   PA|15555|Northeast|
|528509|      50.97|152654|    Beulaville|        Duplin|    Beulaville|   NC|28518|    South|
|912990|      47.23|184896|   New Douglas|       Madison|   New Douglas|   IL|62074|  Midwest|
|214352|      24.66|197537|   Toeterville|      Mitchell|   Toeterville|   IA|50481|  Midwest|
|890290|      58.08|141518| Primm Springs|       Hickman| Primm Springs|   TN|38476|    South|
|622406|      49.85| 73862|     Dutchtown|Cape Girardeau|     Dutchtown|   MO|63745|  Midwest|
+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
only showing top 20 rows

In [27]:
df.join(df_sal, df["Emp ID"]==df_sal["Emp ID"]).show()

+------+-----------+----------+--------------+---------+------+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
|Emp ID|Name Prefix|First Name|Middle Initial|Last Name|Gender|Emp ID|Age in Yrs.|Salary|    Place Name|        County|          City|State|  Zip|   Region|
+------+-----------+----------+--------------+---------+------+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
|677509|       Drs.|      Lois|             H|   Walker|     F|677509|      36.36|168251|        Denver|        Denver|        Denver|   CO|80224|     West|
|940761|        Ms.|    Brenda|             S| Robinson|     F|940761|      47.02| 51063|     Stonewall|       De Soto|     Stonewall|   LA|71078|    South|
|428945|        Dr.|       Joe|             W| Robinson|     M|428945|      54.15| 50155|  Michigantown|       Clinton|  Michigantown|   IN|46057|  Midwest|
|408351|       Drs.|     Diane|             I|    Evans|     F|408351|      39.67|180294|      Hydetown|      Crawford|      Hydetown|   PA|16328|Northeast|
|193819|        Mr.|  Benjamin|             R|  Russell|     M|193819|      40.31|117642|       Fremont|       Waupaca|       Fremont|   WI|54940|  Midwest|
|499687|        Mr.|   Patrick|             F|   Bailey|     M|499687|      34.86| 72305|     Macksburg|       Madison|     Macksburg|   IA|50155|  Midwest|
|539712|        Ms.|     Nancy|             T|    Baker|     F|539712|      22.14| 98189|       Atlanta|        Fulton|       Atlanta|   GA|30334|    South|
|380086|       Mrs.|     Carol|             V|   Murphy|     F|380086|      59.12| 60918|   Blanchester|       Clinton|   Blanchester|   OH|45107|  Midwest|
|477616|       Hon.|   Frances|             B|    Young|     F|477616|      58.18|121587|       Delmita|         Starr|       Delmita|   TX|78536|    South|
|162402|       Hon.|     Diana|             T| Peterson|     F|162402|      29.73| 43010|Eureka Springs|       Carroll|Eureka Springs|   AR|72632|    South|
|231469|        Mr.|     Ralph|             L|   Flores|     M|231469|       42.5|118457|       Sabetha|        Nemaha|       Sabetha|   KS|66534|  Midwest|
|153989|      Prof.|      Jack|             C|Alexander|     M|153989|      22.21| 82965|     Las Vegas|         Clark|     Las Vegas|   NV|89170|     West|
|386158|       Mrs.|   Melissa|             Q|     King|     F|386158|      45.45|166892| New Matamoras|    Washington| New Matamoras|   OH|45767|  Midwest|
|301576|       Hon.|     Wayne|             G|   Watson|     M|301576|       21.1| 92758|         Maida|      Cavalier|         Maida|   ND|58255|  Midwest|
|441771|       Mrs.|    Cheryl|             O|    Scott|     F|441771|      59.47| 92220|      Quecreek|      Somerset|      Quecreek|   PA|15555|Northeast|
|528509|       Hon.|     Paula|             G|     Diaz|     F|528509|      50.97|152654|    Beulaville|        Duplin|    Beulaville|   NC|28518|    South|
|912990|        Mr.|    Joshua|             T|  Stewart|     M|912990|      47.23|184896|   New Douglas|       Madison|   New Douglas|   IL|62074|  Midwest|
|214352|        Ms.|   Theresa|             G|      Lee|     F|214352|      24.66|197537|   Toeterville|      Mitchell|   Toeterville|   IA|50481|  Midwest|
|890290|       Hon.|     Julia|             S|    Scott|     F|890290|      58.08|141518| Primm Springs|       Hickman| Primm Springs|   TN|38476|    South|
|622406|        Mr.|    Thomas|             Q|    Lewis|     M|622406|      49.85| 73862|     Dutchtown|Cape Girardeau|     Dutchtown|   MO|63745|  Midwest|
+------+-----------+----------+--------------+---------+------+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
only showing top 20 rows

In [28]:
df_comb = df.join(df_sal, df["Emp ID"]==df_sal["Emp ID"])

In [29]:
df_comb

DataFrame[Emp ID: string, Name Prefix: string, First Name: string, Middle Initial: string, Last Name: string, Gender: string, Emp ID: string, Age in Yrs.: string, Salary: string, Place Name: string, County: string, City: string, State: string, Zip: string, Region: string]

In [34]:
df.join(df_sal, on=["Emp ID"], how="inner").show()

+------+-----------+----------+--------------+---------+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
|Emp ID|Name Prefix|First Name|Middle Initial|Last Name|Gender|Age in Yrs.|Salary|    Place Name|        County|          City|State|  Zip|   Region|
+------+-----------+----------+--------------+---------+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
|677509|       Drs.|      Lois|             H|   Walker|     F|      36.36|168251|        Denver|        Denver|        Denver|   CO|80224|     West|
|940761|        Ms.|    Brenda|             S| Robinson|     F|      47.02| 51063|     Stonewall|       De Soto|     Stonewall|   LA|71078|    South|
|428945|        Dr.|       Joe|             W| Robinson|     M|      54.15| 50155|  Michigantown|       Clinton|  Michigantown|   IN|46057|  Midwest|
|408351|       Drs.|     Diane|             I|    Evans|     F|      39.67|180294|      Hydetown|      Crawford|      Hydetown|   PA|16328|Northeast|
|193819|        Mr.|  Benjamin|             R|  Russell|     M|      40.31|117642|       Fremont|       Waupaca|       Fremont|   WI|54940|  Midwest|
|499687|        Mr.|   Patrick|             F|   Bailey|     M|      34.86| 72305|     Macksburg|       Madison|     Macksburg|   IA|50155|  Midwest|
|539712|        Ms.|     Nancy|             T|    Baker|     F|      22.14| 98189|       Atlanta|        Fulton|       Atlanta|   GA|30334|    South|
|380086|       Mrs.|     Carol|             V|   Murphy|     F|      59.12| 60918|   Blanchester|       Clinton|   Blanchester|   OH|45107|  Midwest|
|477616|       Hon.|   Frances|             B|    Young|     F|      58.18|121587|       Delmita|         Starr|       Delmita|   TX|78536|    South|
|162402|       Hon.|     Diana|             T| Peterson|     F|      29.73| 43010|Eureka Springs|       Carroll|Eureka Springs|   AR|72632|    South|
|231469|        Mr.|     Ralph|             L|   Flores|     M|       42.5|118457|       Sabetha|        Nemaha|       Sabetha|   KS|66534|  Midwest|
|153989|      Prof.|      Jack|             C|Alexander|     M|      22.21| 82965|     Las Vegas|         Clark|     Las Vegas|   NV|89170|     West|
|386158|       Mrs.|   Melissa|             Q|     King|     F|      45.45|166892| New Matamoras|    Washington| New Matamoras|   OH|45767|  Midwest|
|301576|       Hon.|     Wayne|             G|   Watson|     M|       21.1| 92758|         Maida|      Cavalier|         Maida|   ND|58255|  Midwest|
|441771|       Mrs.|    Cheryl|             O|    Scott|     F|      59.47| 92220|      Quecreek|      Somerset|      Quecreek|   PA|15555|Northeast|
|528509|       Hon.|     Paula|             G|     Diaz|     F|      50.97|152654|    Beulaville|        Duplin|    Beulaville|   NC|28518|    South|
|912990|        Mr.|    Joshua|             T|  Stewart|     M|      47.23|184896|   New Douglas|       Madison|   New Douglas|   IL|62074|  Midwest|
|214352|        Ms.|   Theresa|             G|      Lee|     F|      24.66|197537|   Toeterville|      Mitchell|   Toeterville|   IA|50481|  Midwest|
|890290|       Hon.|     Julia|             S|    Scott|     F|      58.08|141518| Primm Springs|       Hickman| Primm Springs|   TN|38476|    South|
|622406|        Mr.|    Thomas|             Q|    Lewis|     M|      49.85| 73862|     Dutchtown|Cape Girardeau|     Dutchtown|   MO|63745|  Midwest|
+------+-----------+----------+--------------+---------+------+-----------+------+--------------+--------------+--------------+-----+-----+---------+
only showing top 20 rows

In [35]:
df_inner = df.join(df_sal,on=["Emp ID"],how="inner")

In [38]:
df_inner.groupBy("Salary").max().show()

+------+
|Salary|
+------+
|168251|
| 51063|
| 50155|
|180294|
|117642|
| 72305|
| 98189|
| 60918|
|121587|
| 43010|
|118457|
| 82965|
|166892|
| 92758|
| 92220|
|152654|
|184896|
|197537|
|141518|
| 73862|
+------+
only showing top 20 rows

In [43]:
df_inner.orderBy("Salary",descending=True).show(5)

+------+-----------+----------+--------------+---------+------+-----------+------+----------+-------------+---------+-----+-----+-------+
|Emp ID|Name Prefix|First Name|Middle Initial|Last Name|Gender|Age in Yrs.|Salary|Place Name|       County|     City|State|  Zip| Region|
+------+-----------+----------+--------------+---------+------+-----------+------+----------+-------------+---------+-----+-----+-------+
|491943|       Mrs.|     Nancy|             P|   Howard|     F|      56.27|101553|      Saxe|    Charlotte|     Saxe|   VA|23967|  South|
|758872|        Mr.|     Henry|             Y|  Jenkins|     M|      32.75|102384| Riverside|       Platte|Riverside|   MO|64150|Midwest|
|477253|       Mrs.|      Anne|             L|  Russell|     F|      28.02|103160| Stockholm|        Grant|Stockholm|   SD|57264|Midwest|
|802554|        Mr.|      Ryan|             V|Alexander|     M|      24.01|106628|   Jarreau|Pointe Coupee|  Jarreau|   LA|70749|  South|
|333476|       Hon.|      Mary|             P|   Wilson|     F|      49.69|109394| Nashville|     Davidson|Nashville|   TN|37219|  South|
+------+-----------+----------+--------------+---------+------+-----------+------+----------+-------------+---------+-----+-----+-------+
only showing top 5 rows

In [51]:
df_inner.filter(df_inner["Salary"]>100000).show(5)

+------+-----------+----------+--------------+---------+------+-----------+------+----------+--------+--------+-----+-----+---------+
|Emp ID|Name Prefix|First Name|Middle Initial|Last Name|Gender|Age in Yrs.|Salary|Place Name|  County|    City|State|  Zip|   Region|
+------+-----------+----------+--------------+---------+------+-----------+------+----------+--------+--------+-----+-----+---------+
|677509|       Drs.|      Lois|             H|   Walker|     F|      36.36|168251|    Denver|  Denver|  Denver|   CO|80224|     West|
|408351|       Drs.|     Diane|             I|    Evans|     F|      39.67|180294|  Hydetown|Crawford|Hydetown|   PA|16328|Northeast|
|193819|        Mr.|  Benjamin|             R|  Russell|     M|      40.31|117642|   Fremont| Waupaca| Fremont|   WI|54940|  Midwest|
|477616|       Hon.|   Frances|             B|    Young|     F|      58.18|121587|   Delmita|   Starr| Delmita|   TX|78536|    South|
|231469|        Mr.|     Ralph|             L|   Flores|     M|       42.5|118457|   Sabetha|  Nemaha| Sabetha|   KS|66534|  Midwest|
+------+-----------+----------+--------------+---------+------+-----------+------+----------+--------+--------+-----+-----+---------+
only showing top 5 rows

In [56]:
df_inner.orderBy("Emp ID","Salary",ascending=False).show(5)

+------+-----------+----------+--------------+---------+------+-----------+------+--------------------+--------------+--------------------+-----+-----+-------+
|Emp ID|Name Prefix|First Name|Middle Initial|Last Name|Gender|Age in Yrs.|Salary|          Place Name|        County|                City|State|  Zip| Region|
+------+-----------+----------+--------------+---------+------+-----------+------+--------------------+--------------+--------------------+-----+-----+-------+
|979607|        Ms.|     Carol|             J|  Edwards|     F|      22.64| 93967|          Shreveport|         Caddo|          Shreveport|   LA|71162|  South|
|971640|      Prof.|  Clarence|             A|     Ross|     M|      56.66|165272|              Oneida|         Scott|              Oneida|   TN|37841|  South|
|969964|       Hon.|    Janice|             S|   Parker|     F|      37.57|147641|Whiteman Air Forc...|       Johnson|Whiteman Air Forc...|   MO|65305|Midwest|
|969580|      Prof.|   Matthew|             L|   Turner|     M|      23.77| 52237|         Heathsville|Northumberland|         Heathsville|   VA|22473|  South|
|958326|        Mr.|     Larry|             T|   Miller|     M|      28.76| 97904|    East Saint Louis|     St. Clair|    East Saint Louis|   IL|62201|Midwest|
+------+-----------+----------+--------------+---------+------+-----------+------+--------------------+--------------+--------------------+-----+-----+-------+
only showing top 5 rows